t21/Walnut_X/Packages/.cache/Keil.EFM32WGxxx_DFP.1.3.0.pdsc
    <component Cclass="Device" Cgroup="emlib" Csub="VCMP"      Cversion="4.2.1" condition="emlib Framework">
      <description>Voltage Comparator (VCMP) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_VCMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32wg/html/group__VCMP.html"/>
        <file category="header"  name="emlib/inc/em_vcmp.h"/>
        <file category="source"  name="emlib/src/em_vcmp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="WDOG"      Cversion="4.2.1" condition="emlib Framework">
      <description>Watchdog (WDOG) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32wg/html/group__WDOG.html"/>
        <file category="header"  name="emlib/inc/em_wdog.h"/>
        <file category="source"  name="emlib/src/em_wdog.c"/>
      </files>
    </component>

    <bundle Cbundle="EFM32WG-STK3800" Cclass="Board Support" Cversion="4.2.1">
      <description>Silicon Labs EFM32WG-STK3800 Development Kit</description>
      <doc>Boards/SiliconLabs/EFM32WG_STK3800/Documents/efm32wg-stk3800-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32WG BSP core">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3800
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32wg/html/group__Drivers.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_bcc.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk_leds.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32WG_STK3800/config/"/>
        </files>
      </component>

      <component Cgroup="LED" Capiversion="1.00" condition="EFM32WG BSP">
        <description>LED interface for Silicon Labs EFM32WG-STK3800 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32WG_STK3800/Common/LED_STK3800.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="EFM32WG BSP">
        <description>Buttons interface for Silicon Labs EFM32WG-STK3800 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32WG_STK3800/Common/Buttons_STK3800.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Silicon Labs" name="EFM32WG-STK3800" revision="Ver 1.0">
      <description>Silicon Labs EFM32WG Starter Kit</description>
      <image small="Boards/SiliconLabs/EFM32WG_STK3800/Documents/efm32wg-stk3800_small.png"/>
      <book category="overview"  name="http://www.silabs.com/products/mcu/lowpower/pages/efm32wg-stk3800.aspx" title="EFM32TG-STK3300 Web Page"/>
      <book category="manual"    name="Boards/SiliconLabs/EFM32WG_STK3800/Documents/efm32wg-stk3800-ug.pdf" title="User Manual"/>
      <book category="schematic" name="Boards/SiliconLabs/EFM32WG_STK3800/Documents/BRD2400A_A00.pdf"       title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32WG990F256"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32WG990"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="6"             name="LEDs: 4x Status, 2x User"/>
      <feature type="DIO"                          name="Breakout pads for easy access to I/O pins"/>
      <feature type="DIO"                          name="20 pin expansion header"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1"  m="8.20"   name="160 segment Energy Micro LCD"/>
      <feature type="USB"        n="1"             name="USB Micro-AB (OTG) connector"/>
      <feature type="ROM"        n="1"             name="32 MB NAND-Flash"/>
      <feature type="LightSens"  n="1"             name="Ambient Light Sensor"/>
      <feature type="SensOther"  n="1"             name="Inductive-capacitive metal sensor"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="Batt"       n="1"             name="CR2032 battery"/>
      <feature type="ODbg"       n="1"             name="Onboard SEGGER J-Link USB debugger"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32WG_STK3800/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32WG-STK3800" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
